cases/Chapter_6/OC6_III/steadyL11b/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0.01;
        smoother        DICGaussSeidel;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 1000;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         3;
        maxIter         50;
    }

    p
    {
        $pcorr;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|epsilon|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;
    }

    "(U|k|epsilon|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
    turbOnFinalIterOnly false;

    //~ residualControl
    //~ {
        //~ U
        //~ {
            //~ tolerance 1e-6;
            //~ relTol 0;
        //~ }
        //~ p
        //~ {
            //~ tolerance 5e-4;
            //~ relTol 0;
        //~ }
    //~ }
}

//~ relaxationFactors
//~ {
    //~ fields
    //~ {
        //~ p   1;
    //~ }
    //~ equations
    //~ {
        //~ "(U|k|epsilon)"      1;
        //~ "(U|k|epsilon)Final" 1;
    //~ }
//~ }

cache
{
    grad(U);
}

// ************************************************************************* //
